Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum Enumeration
 The available enumerator types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisEnumeratorTypeEnum
Public Enumeration AnalysisEnumeratorTypeEnum
Members
Member name | Value | Description
ALL_SELECTED | 1 |  This selects all the user selected objects.
ALL_OBJECTS | 2 |  This selects all the objects.
ALL_OBJECTS_WITH_TYPE | 3 |  This selects all the objects with the given type as the "subtype".
SUB_ANALYSIS_PARTS_OF_ANALYSIS_PART | 4 |  Sub analysis parts of analysis part.
MAIN_ANALYSIS_PARTS_OF_ANALYSIS_PART | 5 |  Main analysis parts of analysis part.
ANALYSIS_PARTS_BY_NODE | 6 |  Analysis parts connected to node.
ANALYSIS_NODELINKS_BY_NODE | 7 |  Analysis node links connected to node.
See Also
Reference
Tekla.Structures.Analysis Namespace